import numpy as np
from snorkel.augmentation import transformation_function

# Global strings array containing "Masachtot" names
MASACHTOT_BAVLI = ['דברכות', 'ברכות', 'פאה', 'דמאי', 'כלאים', 'שביעית', 'תרומות', 'מעשרות', 'מעשר שני', 'חלה',
                   'ערלה', 'ביכורים', 'שבת', 'דשבת', 'עירובין', 'ערובין', 'פסחים', 'שקלים', 'יומא', 'סוכה', 'ביצה',
                   'ראש השנה', 'תענית', 'דתענית',
                   'מגילה', 'מועד קטן', 'חגיגה', 'יבמות', 'כתובות', 'נדרים', 'נזיר', 'סוטה', 'גיטין', 'גטין',
                   'קידושין', 'קדושין',
                   'בבא קמא', 'בבא מציעא', 'בבא בתרא', 'סנהדרין', 'מכות', 'שבועות', 'עבודה זרה', 'עדיות', 'עדויות',
                   'הוריות', 'אבות',
                   'זבחים', 'מנחות', 'חולין', 'בכורות', 'ערכין', 'תמורה', 'כריתות', 'מעילה', 'תמיד', 'מדות', 'קינים',
                   'כלים', 'אהלות', 'נגעים', 'פרה', 'טהרות', 'מקוואות', 'נדה', 'מכשירין', 'זבים', 'טבול יום', 'ידים',
                   'עוקצין']

SHMOT_PRAKIM = ['מאימתי', 'היה קורא', 'מי שמתו', 'תפלת השחר', 'אין עומדין', 'כיצד מברכין', 'שלושה שאכלו', 'אלו דברים',
                'הרואה',
                'יציאות השבת', 'במה מדליקין', 'כירה', 'במה טומנין', 'במה בהמה', 'במה אשה', 'כלל גדול', 'המוציא יין',
                'אמר רבי עקיבא',
                'המצניע', 'הזורק', 'הבונה', 'האורג', 'שמנה שרצים', 'ואלו קשרים', 'כל כתבי', 'כל הכלים', 'מפנין',
                'רבי אליעזר דמילה', 'תולין',
                'נוטל', 'חבית', 'שואל', 'מי שהחשיך', 'מבוי שהוא גבוה', 'עושין פסים', 'בכל מערבין', 'מי שהוציאוהו',
                'כיצד מעברין', 'הדר',
                'חלון', 'כיצד משתתפין', 'כל גגות', 'המוצא תפילין', 'אור לארבעה עשר', 'כל שעה', 'אלו עוברין',
                'מקום שנהגו', 'תמיד נשחט',
                'אלו דברים', 'כיצד צולין', 'האשה', 'מי שהיה', 'ערבי פסחים', 'ארבעה ראשי שנים', 'אם אינן מכירין',
                'ראוהו בית דין', 'יום טוב',
                'שבעת ימים', 'בראשונה', 'אמר להם הממונה', 'טרף בקלפי', 'הוציאו לו', 'שני שעירי', 'בא לו כהן גדול',
                'יום הכיפורים', 'סוכה',
                'הישן תחת המטה', 'לולב הגזול', 'לולב וערבה', 'החליל', 'ביצה', 'יום טוב', 'אין צדין', 'המביא', 'משילין',
                'מאימתי', 'סדר תענית כיצד',
                'סדר תעניות אלו', 'בשלשה פרקים', 'מגילה נקראת', 'הקורא למפרע', 'הקורא עומד', 'בני העיר',
                'משקין בית השלחין', 'מי שהפך',
                'אלו מגלחין', 'הכל חייבין', 'אין דורשין', 'חומר בקודש', 'חמש עשרה נשים', 'כיצד', 'ארבעה אחין', 'החולץ',
                'רבן גמליאל',
                'הבא על יבמתו', 'אלמנה לכהן גדול', 'הערל', 'יש מותרות', 'האשה רבה', 'נושאין על האנוסה', 'מצות חליצה',
                'בית שמאי',
                'חרש שנשא', 'האשה שלום', 'האשה בתרא', 'בתולה נשאת', 'האשה שנתארמלה', 'אלו נערות', 'נערה שנתפתתה',
                'אף על פי',
                'מציאת האשה', 'המדיר', 'האשה שנפלו', 'הכותב לאשתו', 'מי שהיה נשוי', 'אלמנה ניזונת', 'הנושא את האשה',
                'שני דייני', 'כל כינויי',
                'ואלו מותרים', 'ארבעה נדרים', 'אין בין המודר', 'השותפין', 'הנודר מן המבושל', 'הנודר מן הירק',
                'קונם יין', 'רבי אליעזר', 'נערה המאורסה',
                'ואלו נדרים', 'כל כינויי נזירות', 'הריני נזיר', 'מי שאמר', 'מי שאמר', 'בית שמאי', 'שלשה מינין',
                'כהן גדול', 'שני נזירים', 'הכותים אין להם',
                'המקנא', 'היה מביא', 'היה נוטל', 'ארוסה', 'כשם שהמים', 'מי שקינא', 'אלו נאמרין', 'משוח מלחמה',
                'עגלה ערופה', 'המביא גט',
                'המביא גט', 'כל הגט', 'השולח', 'הניזקין', 'האומר', 'מי שאחזו', 'הזורק', 'המגרש', 'האשה נקנית',
                'האיש מקדש', 'האומר', 'עשרה יוחסין',
                'ארבעה אבות', 'כיצד הרגל', 'המניח', "שור שנגח ד' וה'", 'שור שנגח את הפרה', 'הכונס', 'מרובה', 'החובל',
                'הגוזל עצים', 'הגוזל ומאכיל',
                'שנים אוחזין', 'אלו מציאות', 'המפקיד', 'הזהב', 'איזהו נשך', 'השוכר את האומנין', 'השוכר את הפועלים',
                'השואל את הפרה',
                'המקבל שדה מחבירו', 'הבית והעליה', 'השותפין', 'לא יחפור', 'חזקת הבתים', 'המוכר את הבית',
                'המוכר את הספינה', 'המוכר פירות', 'בית כור',
                'יש נוחלין', 'מי שמת', 'גט פשוט', 'דיני ממונות בשלשה', 'כהן גדול', 'זה בורר', 'אחד דיני ממונות',
                'היו בודקין', 'נגמר הדין', 'ארבע מיתות',
                'בן סורר ומורה', 'הנשרפין', 'אלו הן הנחנקין', 'חלק', 'כיצד העדים', 'אלו הן הגולין', 'אלו הן הלוקין',
                'שבועות שתים', 'ידיעות הטומאה',
                'שבועות שתים', 'שבועת העדות', 'שבועת הפקדון', 'שבועת הדיינין', 'כל הנשבעים', 'ארבעה שומרין',
                'לפני אידיהן', 'אין מעמידין', 'כל הצלמים',
                'רבי ישמעאל', 'השוכר את הפועל', 'הורו בית דין', 'הורה כהן משיח', 'כהן משיח', 'כל הזבחים',
                'כל הזבחים שקבלו דמן', 'כל הפסולין',
                'בית שמאי', 'איזהו מקומן', 'קדשי קדשים', 'חטאת העוף', 'כל הזבחים', 'המזבח מקדש', 'כל התדיר', 'דם חטאת',
                'טבול יום', 'השוחט והמעלה',
                'פרת חטאת', 'כל המנחות', 'הקומץ את המנחה', 'הקומץ רבה', 'התכלת', 'כל המנחות באות מצה', 'רבי ישמעאל',
                'אלו מנחות נקמצות',
                'התודה היתה באה', 'כל קרבנות הציבור', 'שתי מדות', 'שתי הלחם', 'המנחות והנסכים', 'הרי עלי עשרון',
                'הכל שוחטין', 'השוחט', 'אלו טרפות',
                'בהמה המקשה', 'אותו ואת בנו', 'כסוי הדם', 'גיד הנשה', 'כל הבשר', 'העור והרוטב', 'הזרוע והלחיים',
                'ראשית הגז', 'שילוח הקן',
                'הלוקח עובר חמורו', 'הלוקח עובר פרתו', 'הלוקח בהמה', 'עד כמה', 'כל פסולי המוקדשין', 'על אלו מומין',
                'מומין אלו', 'יש בכור',
                'מעשר בהמה', 'הכל מעריכין', 'אין נערכין', 'יש בערכין', 'השג יד', 'האומר משקלי עלי', 'שום היתומים',
                'אין מקדישין', 'המקדיש שדהו',
                'המוכר שדהו', 'הכל ממירין', 'יש בקרבנות', 'אלו קדשים', 'ולד חטאת', 'כיצד מערימין', 'כל האסורין',
                'יש בקדשי מזבח', 'שלשים ושש',
                'ארבעה מחוסרי כפרה', 'אמרו לו', 'ספק אכל חלב', 'דם שחיטה', 'המביא אשם', 'קדשי קדשים', 'חטאת העוף',
                'ולד חטאת', 'קדשי מזבח',
                'הנהנה מן ההקדש', 'השליח שעשה', 'בשלשה מקומות', 'ראוהו אחיו', 'אמר להם הממונה', 'לא היו כופתין',
                'אמר להם הממונה', 'החלו עולים',
                'בזמן שכהן גדול', 'שמאי', 'כל היד', 'המפלת חתיכה', 'בנות כותים', 'יוצא דופן', 'בא סימן', 'דם הנדה',
                'הרואה כתם', 'האשה שהיא עושה',
                'תינוקת', 'אע"פ"ץ', 'המקבל']

def choose_random(itm,lst):
    if len(lst) < 2: return itm
    while True:
        chosen = np.random.choice(lst)
        if chosen is not itm:
            return chosen

@transformation_function()
def change_perek(x):
    for perek in SHMOT_PRAKIM:
        if perek in x.text:
            new_perek = choose_random(perek,SHMOT_PRAKIM)
            x.text = x.text.replace(perek,new_perek)
            return x
    return x



@transformation_function()
def change_masechet(x):
    for masechet in MASACHTOT_BAVLI:
        if masechet in x.text:
            new_masechet = choose_random(masechet,MASACHTOT_BAVLI)
            x.text = x.text.replace(masechet,new_masechet)
            return x
    return x
