{"examples":[{"string":" לשון חידוד מלשון ברזל בברזל יחד (משלי כז.יז) כי הממון דומה לסכין מחודד החותך מהרה וכל דיין צריך להיות מתון שלא יחתוך הדין מהרה וכשקבל השוחד הרי הוא יודע לאלתר להיכן הדין נוטה וחותכו מהרה כחותך בסכין חד, ולא הדיין חותך הדין אלא הממון חותך והוא חד. ולפי שרמז כאן שהדיין צריך להיות מתון בדין ועי ז יבא לידי עינוי הדין להשהותו יותר מכדי הראוי, ע כ אמר צדק צדק תרדוף. לפי שהנביא מאשים את ישראל באמרו צדק ילין בה (ישעיה א.כא) כדרך שפרשנו למעלה פר' דברים (א.יח) שבדיני נפשות גומרין בו ביום לזכות אבל לא לחובה והם הפכו השיטה והיו מלינים הצדק דהיינו הזכות, ע ז אמר כאן שצדק תרדוף כי לשון רדיפה מורה על המהירות שימהר לחתוך הדין כשנתברר זכותו דהיינו הצדק, וכפל הצדק חד לגופיה וחד למעט החובה שחייב להלין.  ד א שחד שהוא חד כחרב החותך, כך עיוות הדין מביא חרב חדה לעולם כדאיתא באבות (ה.יא) חרב בא לעולם על עינוי הדין ועל עיוות הדין, לכך נקרא השחד המעוות הדין שחד שהוא חד כחרב. ואח כ הזהיר גם על עינוי הדין באמרו צדק צדק תרדוף. שימהר לומר פלוני אתה זכאי לגלות צדקתו למען תחיה ותנצל מן החרב, וירשת את הארץ פירש י כדאי הוא מינוי הדיינין הכשרים להחיות את ישראל ולהושיבם על אדמתם. וטעם להחיות לפי שאלמלא מוראה איש את רעהו חיים בלעו (אבות ג.ב) לכך אמרו שמנוי הדיינים גורם להחיות ר ל שלא יבלע איש את רעהו חיים ולהושיבם על אדמתם כמ ש (משלי כט.ד) מלך במשפט יעמיד ארץ. אבל קלקול הדינין גורם השחתת הארץ ודור המבול יוכיח וכן אמר יתרו וגם כל העם על מקומו יבא בשלום (שמות יח.כג) הל ל איש על מקומו ישב בשלום, אלא שמדבר במקום כללי המיוחד לכל העם אשר כעת רצו לבא שמה ואמר יתרו שבזכות מנוי הדיינים יזכו לבא שמה.  ועל דרך הרמז י ל שהזכיר כאן המשפט וצדקה, לפי שיש לפעמים דיין העושה צדקה ומשפט כאחד כדרך שעשה דוד המלך משפט לזה וצדקה לזה (סנהדרין ו:) ויש הפרש בין משפט לצדקה כי המשפט צריך להיות במתון והצדקה ברדיפה ומהירות כמ ש (משלי כא.כא) רודף צדקה וחסד ימצא חיים. וכתיב (ישעיה נו.א) שמרו משפט ועשו צדקה. ושמרו לשון שמרים כי המשקה העומד על שמריו זמן רב יפלו השמרים למטה וישאר המשקה צלול ועל דרך שנאמר (תהלים עג.כא) כי יתחמץ לבבי וגו'. כך מי שהוא מתון בדין גורם להרחיק כל הטעויות הגורמים עכירת השכל, ועשו צדקה לאלתר בלא המתנה מיד תן לו ואל תדחהו, כך נאמר כאן לא תקח שוחד שהוא חד וחותך הדין מהרה אלא צריך להיות מתון בדבר המשפט, אבל הצדקה לא כן אלא צדק צדק תרדוף, ברדיפה ומהירות למען תחיה כי רודף צדקה וחסד ימצא חיים, וירשת את הארץ כי הדינין יושיבום על אדמתם ומלך במשפט יעמיד ארץ. (כלי יקר)    שפתי חכמים  (י) פירוש אף על פי דכל בית דין יכולין לדון הנתבע בעל כרחו מכל מקום מצוה על התובע שילך אחר בית דין יפה. דאין לומר כמשמעו בצדק תשפוט למה לי ועוד צדק צדק למה לי ועוד הא כבר כתיב לא תטה משפט אלא הלך וכו: (כ) דק ל דהא צדק תרדוף שילך אחר בית דין יפה לא נצטוה אלא מי שיש לו דין עם חבירו וכי בשביל זה יחיו (ברכות קג.)כל ישראל וירשו את הארץ ומתרץ דלמען תחיה לא קאי אצדק צדק תרדוף אלא מוסב אשופטים ושוטרים תתן לך וכו': (שפתי חכמים)   אבן עזרא  צדק צדק. עם בעלי הריב ידבר וטעם שני פעמים לדבר צדק שירויח בו או יפסיד או פעם אחר פעם כל ימי היותך או לחזוק: למען תחיה. עם הבאים אל הארץ ידבר: וירשתה. עם בניהם ידבר והטעם שתעמוד לך זו הירושה והדבר שיתחיל השופט לדקדק(נזיקין ל) הוא על עבודת גילולים המפורסמ' בתחלה כמו לא תטע לך אשרה כי כן משפט ע''ג אחר אחת בתוך: (אבן עזרא)   הרמב ן  צדק צדק תרדף. הלך אחר ב ד יפה למען תחיה וירשת את הארץ כדאי הוא מינוי הדיינין הכשרים להחיות את ישראל ולהושיבן על אדמתם לשון רש י מספרי (שופטים קמד) וטעם הכפל לומר הדיינין צריכין שישפטו את העם משפט צדק וגם אתה צריך לרדוף הצדק תמיד שתלך ממקומך אל מקום חכמים הגדולים אחרי רבן יוחנן בן זכאי ליבנה אחר רבי לבית שערים ור א אמר צדק צדק פעמים שירדוף אחרי הצדק שירויח בו או יפסיד או פעם אחר פעם לחזוק אבל במדרשו של ר' נחוניא בן הקנה ידרשו בו סוד אמרו צדק זו מידת דינו של עולם שנאמר צדק צדק תרדוף וכתיב בתריה למען תחיה וירשת את הארץ אם תדין עצמך תחיה אם לאו הוא ידין עליך ותקים בעל כרחך ומאי צדק צדק תרי זימני דכתיב ( כב יג) מנגה נגדו צדק ראשון צדק ממש זו שכינה דכתיב (ישעיהו א כא) צדק ילין בה ומאי צדק שני שמפחיד את הצדיקים ומפרש שם צדק הוי כובע ישועה על ראשו ואין ראש אלא אמת שנאמר (תהלים קיט קס) ראש דברך אמת ואין אמת אלא שלום שנאמר (מלכים ב כ יט) הלא אם שלום ואמת יהיה בימי וגו' אם כן יאמר הכתוב תשפוט אתה בבית דינך ותרדוף צדק צדק ותשיג אותם למען תחיה לעולם הבא בצדק השני שהוא צדק עליון והוא האור הגדול הצפון לצדיקים לעתיד לבא (ברכות ט.)והוא עוזו של הקב ה וירשת את הארץ בצדק הראשון שהוא ארץ ישראל (הרמב ן)   אור החיים  צדק צדק תרדוף וגו'. בא להזהיר כשיש בעיר ב' אנשים מופלגים בחכמה ושנים אחרים גם כן חכמים אלא שאינם בסוג הראשון אל יאמר אדם כיון ששני אנשים יכולין להורות ולשפוט בצדק לא אטריח את המופלגים לישא בעול מינוי הדיינות, או לצד שצריך(ברכות א:) להם טורח במינוים ימנע ויסתפק בקטנים, תלמוד לומר צדק (ברכות קגא.)צדק פירוש הגם שהשגת (ברכות ב:)לדיינים שהם ראויים, עליך לחזור אחר היותר ראוים מהם: (אור החיים)   ספורנו  צדק צדק תרדוף. כשתתן לך שופטים אתה הממנה את השופטים בהו את היותר שופטי צדק אע''פ שאין בהם כל כך שאר תכסיסים הראוים לדיין כמו שלמות(ברכות י) הקנין ושלמות הגוף כענין אל תבט אל מראהו ואל גבה קומתו: למען תחיה וירשת. תצ " , "match":[ { "start":1113,"end":1120},{ "start":1602,"end":1611},{ "start":2567,"end":2575},{ "start":4054,"end":4061},{ "start":4367,"end":4374},{ "start":4430,"end":4439},{ "start":4462,"end":4469},{ "start":4676,"end":4682}]}]}